apps/klipper-api/app/controllers/api/v1/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."active" = $2 ORDER BY "accounts"."name" ASC  [["user_id", 13], ["active", true]]
---
      def index
        accounts = current_user.accounts.active.order(:name)

INSERT INTO "accounts" ("account_type", "active", "balance", "created_at", "currency", "institution", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        account = current_user.accounts.build(account_params)
        if account.save

UPDATE "accounts" SET "name" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["name", "New Name"], ["updated_at", "2026-06-26 19:19:25.433944"], ["id", 18]]
---
      def update
        if @account.update(account_params)

UPDATE "accounts" SET "active" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["active", false], ["updated_at", "2026-06-26 19:19:25.442860"], ["id", 19]]
---
      def destroy
        @account.update!(active: false)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 19], ["LIMIT", 1]]
---
      def set_account
        @account = current_user.accounts.find(params[:id])