apps/klipper-api/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-06-26 19:10:37.574604"], ["email", "[FILTERED]"], ["name", "Test User"], ["password_digest", "[FILTERED]"], ["updated_at", "2026-06-26 19:10:37.574604"]]
---
      def sign_up
        user = User.new(sign_up_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
      def sign_in
        user = User.find_by(email: params[:email]&.downcase)