apps/klipper-api/app/controllers/api/v1/budgets_controller.rb

SELECT "budgets".* FROM "budgets" WHERE "budgets"."user_id" = $1 AND "budgets"."period_year" = $2 AND "budgets"."period_month" = $3 ORDER BY "budgets"."period_year" ASC, "budgets"."period_month" ASC  [["user_id", 98], ["period_year", 2026], ["period_month", 6]]
---
      def index
        budgets = current_user.budgets.includes(:category)
        budgets = budgets.for_period(params[:year].to_i, params[:month].to_i) if params[:year] && params[:month]
        render json: budgets.order(:period_year, :period_month)

INSERT INTO "budgets" ("amount_limit", "category_id", "created_at", "period_month", "period_year", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
        unless current_user.categories.exists?(id: budget_params[:category_id])
          return render json: { errors: [ "Categoria inválida" ] }, status: :unprocessable_entity
        end

        budget = current_user.budgets.build(budget_params)
        if budget.save

UPDATE "budgets" SET "amount_limit" = $1, "updated_at" = $2 WHERE "budgets"."id" = $3  [["amount_limit", "750.0"], ["updated_at", "2026-06-26 19:30:53.588369"], ["id", 14]]
---
      def update
        if budget_params.key?(:category_id) && !current_user.categories.exists?(id: budget_params[:category_id])
          return render json: { errors: [ "Categoria inválida" ] }, status: :unprocessable_entity
        end

        if @budget.update(budget_params)

DELETE FROM "budgets" WHERE "budgets"."id" = $1  [["id", 15]]
---
      def destroy
        @budget.destroy!

SELECT "budgets".* FROM "budgets" WHERE "budgets"."user_id" = $1 AND "budgets"."id" = $2 LIMIT $3  [["user_id", 105], ["id", 15], ["LIMIT", 1]]
---
      def set_budget
        @budget = current_user.budgets.find(params[:id])