apps/klipper-api/app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."active" = $2 ORDER BY "categories"."name" ASC  [["user_id", 27], ["active", true]]
---
      def index
        categories = current_user.categories.active.order(:name)

INSERT INTO "categories" ("active", "category_type", "color", "created_at", "icon", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def create
        category = current_user.categories.build(category_params)
        if category.save

UPDATE "categories" SET "active" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["active", false], ["updated_at", "2026-06-26 19:19:25.548620"], ["id", 26]]
---
      def destroy
        @category.update!(active: false)

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 35], ["id", 26], ["LIMIT", 1]]
---
      def set_category
        @category = current_user.categories.find(params[:id])