apps/klipper-api/app/controllers/api/v1/investments_controller.rb

      def index
        investments = current_user.investments.includes(:account)
        investments = investments.by_type(params[:type]) if params[:type]
        render json: investments.order(:name)
---
SELECT "investments".* FROM "investments" WHERE "investments"."user_id" = $1 ORDER BY "investments"."name" ASC  [["user_id", 186]]

      def create
        unless valid_investment_fk?
          return render json: { errors: [ "Conta inválida" ] }, status: :unprocessable_entity
        end

        investment = current_user.investments.build(investment_params)
        if investment.save
---
INSERT INTO "investments" ("account_id", "average_price", "created_at", "currency", "investment_type", "name", "quantity", "ticker", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

      def update
        unless valid_investment_fk?
          return render json: { errors: [ "Conta inválida" ] }, status: :unprocessable_entity
        end

        if @investment.update(investment_params)
---
UPDATE "investments" SET "quantity" = $1, "updated_at" = $2 WHERE "investments"."id" = $3  [["quantity", "20.0"], ["updated_at", "2026-06-26 19:31:24.833299"], ["id", 12]]

      def destroy
        @investment.destroy!
---
DELETE FROM "investments" WHERE "investments"."id" = $1  [["id", 13]]

      def set_investment
        @investment = current_user.investments.find(params[:id])
---
SELECT "investments".* FROM "investments" WHERE "investments"."user_id" = $1 AND "investments"."id" = $2 LIMIT $3  [["user_id", 196], ["id", 13], ["LIMIT", 1]]