apps/klipper-api/app/controllers/api/v1/transactions_controller.rb

      def index
        txns = current_user.transactions.includes(:account, :category)
        txns = txns.in_month(params[:year].to_i, params[:month].to_i) if params[:year] && params[:month]
        txns = txns.where(account_id: params[:account_id]) if params[:account_id]
        txns = txns.where(transaction_type: params[:type]) if params[:type]
        render json: txns.order(occurred_on: :desc, id: :desc)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."occurred_on" BETWEEN $2 AND $3 ORDER BY "transactions"."occurred_on" DESC, "transactions"."id" DESC  [["user_id", 116], ["occurred_on", "2026-06-01"], ["occurred_on", "2026-06-30"]]

      def create
        txn = current_user.transactions.build(transaction_params)
        txn.account = current_user.accounts.find_by(id: txn.account_id)
        if txn.category_id.blank?
          auto = AutoCategorizerService.call(txn.description.to_s, current_user)
          txn.category = auto if auto
        end
        if txn.save
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2 LIMIT $3  [["user_id", 124], ["id", 66], ["LIMIT", 1]]
INSERT INTO "transactions" ("account_id", "amount", "category_id", "created_at", "description", "installment_number", "installment_total", "notes", "occurred_on", "parent_transaction_id", "transaction_type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

      def update
        if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "description" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["description", "New"], ["updated_at", "2026-06-26 19:30:53.810167"], ["id", 21]]

      def destroy
        @transaction.destroy!
---
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 22]]

      def set_transaction
        @transaction = current_user.transactions.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."id" = $2 LIMIT $3  [["user_id", 128], ["id", 22], ["LIMIT", 1]]